ProblemSet/Techniques.tex
% Created 2018-05-13 Sun 00:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{\href{./NsqerN}{NsqrtN}}
\label{sec:org85d1e00}
\subsection{\href{./NsqrtN/MedianRangeIncrement.cc}{Median with range increment}\hfill{}\textsc{Seerc:Seerc14:NsqrtN:AC:Median}}
\label{sec:org71d4206}
Given N numbers find the median with range queries to increment segement value by one


\section{\href{./MatrixExponentiation}{Matrix Exponentiation}}
\label{sec:org7a4035e}
\subsection{\href{./MatrixExponentiation/StateExponentiation.cc}{Matrix as State transition}\hfill{}\textsc{Swerc:Swerc2017:MatrixExponentiation:StateTransition:AC}}
\label{sec:org800690e}
Given 1x2 domino pieces find number of ways to fill a 8xN board


\section{\href{./Flows}{Flows}}
\label{sec:org6a9d455}
\subsection{\href{./Flows/MinimumCostMatching.cc}{Min cost Bipartite Matching}\hfill{}\textsc{Swerc:Swerc2017:Hungarian:Flow:Matching:Minweight:Maxmatching:AC:Bipartite:Mincost}}
\label{sec:org343bf3a}

\subsection{\href{./Flows/MaxWeightBipartiteMatching.cc}{Max Weight Bipartite Matching}\hfill{}\textsc{SCITIES:SPOJ:Bipartite:Matching:Maxcost:AC}}
\label{sec:org4701425}


\section{\href{./Graphs/}{Graphs}}
\label{sec:org0b4d9d2}
\subsection{\href{./Graphs/VertexInOneSimpleCycle.cc}{VertexInOneSimpleCycle.cc}\hfill{}\textsc{Graphs:CycleSpace:SimpleCycle}}
\label{sec:org6b8e169}

\section{\href{./Maths/}{Maths}}
\label{sec:org9df0119}
\subsection{\href{./Maths/PerfectSquareGroup.cc}{PerfectSquareGroup.cc}\hfill{}\textsc{Maths:Equivalence:Relation:AC}}
\label{sec:org5b89fbe}
\end{document}